<a href="https://colab.research.google.com/github/helianakhjavani/Recommended-system/blob/main/2_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import numpy as np
import pandas as pd

**Pandas series**

In [4]:
data = np.array(['a', 'b', 'c', 'd'])
pd.Series(data)

0    a
1    b
2    c
3    d
dtype: object

In [5]:
pd.Series(data, index = [1,2,3,4])

1    a
2    b
3    c
4    d
dtype: object

In [8]:
pd.Series(data, index = [j for j in range(1,5)])

1    a
2    b
3    c
4    d
dtype: object

NAN

In [9]:
np.nan

nan

In [11]:
s= pd.Series([1, 3, 5, np.nan, 10 , 5, 8])
s

0     1.0
1     3.0
2     5.0
3     NaN
4    10.0
5     5.0
6     8.0
dtype: float64

In [13]:
data1 = {"a" : 0,"b" : 1, "c" : 2, "d" : 3}
data1

{'a': 0, 'b': 1, 'c': 2, 'd': 3}

In [14]:
s1 = pd.Series(data1)
s1

a    0
b    1
c    2
d    3
dtype: int64

In [15]:
s[3]

nan

In [16]:
s[1:4]

1    3.0
2    5.0
3    NaN
dtype: float64

In [18]:
s[-3:]

4    10.0
5     5.0
6     8.0
dtype: float64

In [19]:
s1[2]

2

In [20]:
s1['b']

1

**Pandas Dataframe**

In [21]:
data = [1,2,3,4,5]
df = pd.DataFrame(data)
df

   0
0  1
1  2
2  3
3  4
4  5

In [24]:
input = {'FistName' : ["Sajjad", "Ali", "Mohsen"], 'LastName' : ["Heydari", "Jahani", "Royati"]}
index = [1,2,3]

df1 = pd.DataFrame(input, index)
df1

  FistName LastName
1   Sajjad  Heydari
2      Ali   Jahani
3   Mohsen   Royati

In [25]:
data1 = [["sajjad", "Heydari"],["Ali", "Jahani"], ["Mohsen", "Royati"]]
df2 = pd.DataFrame(data1, index = [1,2,3], columns = ["FirstName", "LastName"])
df2

  FirstName LastName
1    sajjad  Heydari
2       Ali   Jahani
3    Mohsen   Royati

In [28]:
#example
data2 = [[1,2,np.nan], [5,10,20]]
df3 = pd.DataFrame(data2, columns = ["A", "B", "C"])
df3

   A   B     C
0  1   2   NaN
1  5  10  20.0

In [29]:
data3 = {"ONE" : pd.Series([1,2,3], index = ["A", "B", "C"])  , "TWO" : pd.Series([1,2,3,4], index = ["A", "B", "C" , "D"])}
df4 = pd.DataFrame(data3)
df4

   ONE  TWO
A  1.0    1
B  2.0    2
C  3.0    3
D  NaN    4

In [30]:
df4["THREE"] = pd.Series([10,20,30], index = ["A", "B", "C"]) 
df4

   ONE  TWO  THREE
A  1.0    1   10.0
B  2.0    2   20.0
C  3.0    3   30.0
D  NaN    4    NaN

In [31]:
df4["FOUR"] = df4["ONE"] + df4["TWO"] + df4["THREE"]
df4

   ONE  TWO  THREE  FOUR
A  1.0    1   10.0  12.0
B  2.0    2   20.0  24.0
C  3.0    3   30.0  36.0
D  NaN    4    NaN   NaN

In [32]:
df4.pop("FOUR")

A    12.0
B    24.0
C    36.0
D     NaN
Name: FOUR, dtype: float64

In [34]:
df4

   ONE  TWO  THREE
A  1.0    1   10.0
B  2.0    2   20.0
C  3.0    3   30.0
D  NaN    4    NaN

In [36]:
df5 = df4.drop("ONE", axis = 1)  #axis 1 for columns

In [37]:
df5

   TWO  THREE
A    1   10.0
B    2   20.0
C    3   30.0
D    4    NaN

In [38]:
df6 = df5.drop("D", axis = 0)
df6

   TWO  THREE
A    1   10.0
B    2   20.0
C    3   30.0